{
    "game": {
        "single": [
            {
                "category": "Roll Badge",
                "clues": [
                    {
                        "value": 200,
                        "clue": "This infamous local personality became a campus legend dwelling in the university's underground tunnel system.",
                        "solution": "Who is Tunnel Bob (Robert Gruenenwald)?"
                    },
                    {
                        "value": 400,
                        "clue": "The last time the Badgers went to the Rose Bowl.",
                        "solution": "What is 2020?"
                    },
                    {
                        "value": 600,
                        "clue": "The only library on campus that requires a wiscard to enter.",
                        "solution": "What is Memorial Library?"
                    },
                    {
                        "value": 800,
                        "clue": "With multiple national championships, this UW-Madison program stands as the school's most successful NCAA sport.",
                        "solution": "What is Women's Hockey?"
                    },
                    {
                        "value": 2000,
                        "clue": "The current chair of the Computer Sciences department.",
                        "solution": "Who is Paul Barford?"
                    }
                ]
            },
            {
                "category": "Smash or Hash",
                "clues": [
                    {
                        "value": 200,
                        "clue": "This linear data structure follows the Last In, First Out (LIFO) principle.",
                        "solution": "What is a Stack?"
                    },
                    {
                        "value": 400,
                        "clue": "This algorithm repeatedly swaps adjacent elements until the list is sorted.",
                        "solution": "What is Bubble Sort?"
                    },
                    {
                        "value": 600,
                        "clue": "This greedy algorithm is used to find the minimum spanning tree of a connected, undirected graph.",
                        "solution": "What is Kruskal's Algorithm?"
                    },
                    {
                        "value": 800,
                        "clue": "This is the name of the optimal path-finding algorithm that uses a heuristic.",
                        "solution": "What is A-star?"
                    },
                    {
                        "value": 2000,
                        "clue": "This is the term for extending the size of a hashset and changing the key matches.",
                        "solution": "What is rehash?"
                    }
                ]
            },
            {
                "category": "Tools & Tech",
                "clues": [
                    {
                        "value": 200,
                        "clue": "Developed by the Mozilla Foundation, this open-source browser got its fiery name from the red panda.",
                        "solution": "What is Firefox?"
                    },
                    {
                        "value": 400,
                        "clue": "\"Secure\" yourself a terminal connection to a remote computer with this three-letter command.",
                        "solution": "What is SSH?"
                    },
                    {
                        "value": 600,
                        "clue": "This framework, named for a subatomic particle, is the \"energy\" powering Atom, Visual Studio Code, Discord, and Slack.",
                        "solution": "What is Electron?"
                    },
                    {
                        "value": 800,
                        "clue": "This cloud computing service is known for its ability to \"elastically\" adapt to demand.",
                        "solution": "What is Amazon Web Services (AWS)?"
                    },
                    {
                        "value": 2000,
                        "clue": "Unlike full VMs, these lightweight virtualized environments share an operating system kernel with their host.",
                        "solution": "What are containers?"
                    }
                ]
            },
            {
                "category": "Programming Languages",
                "clues": [
                    {
                        "value": 200,
                        "clue": "Used in devices from smartphones to credit card chips, this programming language runs on over 56 billion devices globally.",
                        "solution": "What is Java?"
                    },
                    {
                        "value": 400,
                        "clue": "Developed in just 10 days by Brendan Eich at Netscape in 1995, this scripting language was originally called Mocha before becoming the cornerstone of web interactivity.",
                        "solution": "What is JavaScript?"
                    },
                    {
                        "value": 600,
                        "clue": "This \"crabby\" programming language is known for its breakout feature, the borrow checker.",
                        "solution": "What is Rust?"
                    },
                    {
                        "value": 800,
                        "clue": "Known for its unforgiving type system, this \"objective\" language used at Jane Street has been dubbed \"developer rights management.\"",
                        "solution": "What is OCaml?"
                    },
                    {
                        "value": 2000,
                        "clue": "Developed at Bell Labs in 1969 by Ken Thompson, this short-lived language served as the direct predecessor to C.",
                        "solution": "What is B?"
                    }
                ]
            },
            {
                "category": "Famous Firsts",
                "clues": [
                    {
                        "value": 200,
                        "clue": "The first video uploaded to this site was titled \"Me at the zoo\" and featured co-founder Jawed Karim.",
                        "solution": "What is YouTube?"
                    },
                    {
                        "value": 400,
                        "clue": "In 1995, Amazon sold its first item, which was one of these physical objects.",
                        "solution": "What is a book?"
                    },
                    {
                        "value": 600,
                        "clue": "The first SMS text message ever sent wished the receiver a Merry this.",
                        "solution": "What is Christmas?"
                    },
                    {
                        "value": 800,
                        "clue": "The first computer mouse, invented by Douglas Engelbart in 1964, was carved from this material.",
                        "solution": "What is wood?"
                    },
                    {
                        "value": 2000,
                        "clue": "Grace Hopper popularized the term \"debugging\" after finding one of these insects trapped in a relay of the Harvard Mark II computer.",
                        "solution": "What is a moth?"
                    }
                ]
            },
            {
                "category": "Tech News",
                "clues": [
                    {
                        "value": 200,
                        "clue": "Under U.S. legislation threatening a ban unless its China-based owner divests, this short-video platform's American operations are set to be acquired by which company?",
                        "solution": "What is Oracle?"
                    },
                    {
                        "value": 400,
                        "clue": "With thousands of satellites in low Earth orbit, this network expanded global broadband and began testing direct-to-cell service with carriers.",
                        "solution": "What is Starlink?"
                    },
                    {
                        "value": 600,
                        "clue": "To cut e-waste and standardize charging, the EU mandated that most new phones, tablets, and small electronics sold after late 2024 use this connector.",
                        "solution": "What is USB-C?"
                    },
                    {
                        "value": 800,
                        "clue": "This Bay Area company recently admitted to running over the \"Mayor of 16th street\", KitKat (rip).",
                        "solution": "What is Waymo?"
                    },
                    {
                        "value": 2000,
                        "clue": "This Himalayan nation launched an official Discord server to share updates, gather feedback, and engage citizens.",
                        "solution": "What is Nepal?"
                    }
                ]
            }
        ],
        "double": [],
        "final": {
            "category": "Final Jeopardy",
            "clue": "This data structure \"balances\" itself such that node heights differ by at most 1, maintaining logarithmic time search, insertion, and deletion operations.",
            "solution": "What is an AVL tree?"
        }
    }
}
